com.orbps.publicSearch = {};
$(function(){ 
  //查询显示银行代码函数
    com.orbps.publicSearch.bankCodeQuery = function(bankCode){
        switch(bankCode){
            case "1101":
                return "中国工商银行";
            case "1102":
                return "中国农业银行";
            case "1103":
                return "中国银行";
            case "1104":
                return "中国建设银行";
            case "1105":
                return "交通银行";
            case "1106":
                return "中国光大银行";
            case "1107":
                return "城市商业银行";
            case "1108":
                return "华夏银行";
            case "1109":
                return "民生银行";
            case "1110":
                return "深圳发展银行";
            case "1111":
                return "招商银行";
            case "1112":
                return "农村信用社";
            case "1113":
                return "上海浦东发展银行";
            case "1114":
                return "兴业银行";
            case "1115":
                return "广东发展银行";
            case "1116":
                return "中信实业银行";
            case "1133":
                return "中国人民银行";
            case "1200":
                return "中国邮政";
            case "1602":
                return "上海银行";
            case "1603":
                return "江苏银行";
            case "1604":
                return "南京市商业银行";
            case "1615":
                return "北京银行";
            case "1621":
                return "上海农村商业银行";
            case "1628":
                return "顺德农村商业银行";
            case "1812":
                return "无锡农村商业银行";
            case "1817":
                return "山西省晋商银行";
            case "1818":
                return "浙江民泰商业银行";
            case "1819":
                return "华融湘江银行";
            case "1820":
                return "浙江泰隆商业银行";
            case "1821":
                return "台州商业银行";
            case "1822":
                return "江苏江阴农村商业银行";
            case "1824":
                return "江南银行";
            case "1825":
                return "长江银行";
            case "1826":
                return "江苏常熟农村商业银行";
            case "1827":
                return "太仓农村商业银行";
            case "1828":
                return "江苏吴江农村商业银行";
            case "1829":
                return "安徽农信社";
            case "1832":
                return "武汉农村商业银行";
            case "1834":
                return "重庆银行";
            case "1836":
                return "苏州银行";
            case "1840":
                return "长沙银行";
            case "1845":
                return "南昌银行";
            case "9907":
                return "翼支付";
            case "9998":
                return "银联";
            case "1685":
                return "东莞农村商业银行";
            default :
                break;
        }
    }
    com.orbps.publicSearch.checkPostCode = function(postCode){
    	if(postCode === "999077"){
    		return "香港";
    	}else if(postCode === "999078"){
    		return "澳门";
    	}
    	postCode = postCode.substr(0,2);
    	switch(postCode){
    	case "10" :
    		return "北京";
    	case "30" :
    		return "天津";
    	case "01" :
    		return "内蒙";
    	case "02" :
    		return "内蒙";
    	case "03" :
    		return "山西";
    	case "04" :
    		return "山西";
    	case "05" :
    		return "河北";
    	case "06" :
    		return "河北";
    	case "07" :
    		return "河北";
    	case "11" :
    		return "辽宁";
    	case "12" :
    		return "辽宁";
    	case "13" :
    		return "吉林";
    	case "15" :
    		return "黑龙江";
    	case "16" :
    		return "黑龙江";
    	case "20" :
    		return "上海";
    	case "21" :
    		return "江苏";
    	case "22" :
    		return "江苏";
    	case "23" :
    		return "安徽";
    	case "23" :
    		return "安徽";
    	case "25" :
    		return "山东";
    	case "26" :
    		return "山东";
    	case "27" :
    		return "山东";
    	case "31" :
    		return "浙江";
    	case "32" :
    		return "浙江";
    	case "33" :
    		return "江西";
    	case "34" :
    		return "江西";
    	case "35" :
    		return "福建";
    	case "36" :
    		return "福建";
    	case "40" :
    		return "重庆";
    	case "41" :
    		return "湖南";
    	case "42" :
    		return "湖南";
    	case "43" :
    		return "湖北";
    	case "44" :
    		return "湖北";
    	case "45" :
    		return "河南";
    	case "46" :
    		return "河南";
    	case "47" :
    		return "河南";
    	case "51" :
    		return "广东";
    	case "52" :
    		return "广东";
    	case "53" :
    		return "广西";
    	case "54" :
    		return "广西";
    	case "55" :
    		return "贵州";
    	case "56" :
    		return "贵州";
    	case "57" :
    		return "海南";
    	case "61" :
    		return "四川";
    	case "62" :
    		return "四川";
    	case "63" :
    		return "四川";
    	case "64" :
    		return "四川";
    	case "65" :
    		return "云南";
    	case "66" :
    		return "云南";
    	case "67" :
    		return "云南";
    	case "71" :
    		return "陕西";
    	case "72" :
    		return "陕西";
    	case "73" :
    		return "甘肃";
    	case "74" :
    		return "甘肃";
    	case "75" :
    		return "宁夏";
    	case "81" :
    		return "青海";
    	case "83" :
    		return "新疆";
    	case "84" :
    		return "新疆";
    	case "85" :
    		return "西藏";
    	case "86" :
    		return "西藏";
    	 default :
             break;
    
    	}
    }

    //查询显示资料类型
    com.orbps.publicSearch.filesTypeQuery = function(fileType){
        switch (fileType) {
        case "1001":
            return "个人投保单";
        case "1108":
            return "个人投保单(新)";
        case "1185":
            return "个人投保单(税优)";
        case "1005":
            return "汇交件申请书";
        case "1022":
            return "汇交申请书(乙)";
        case "7020":
            return "汇交申请书(丙)";
        case "1016":
            return "团体投保单";
        case "1017":
            return "被保险人清单";
        case "1030":
            return "建工险投保单";
        case "1002":
            return "附件";
        case "1110":
            return "个人投保单(可撕式)";
        case "1085":
            return "个人短险业务专用投保单";
        case "1145":
            return "团体保险投保单(新)";
        case "1146":
            return "建筑工程团体人身意外伤害保险投保单";
        case "1147":
            return "被保险人分组要约属性表(团单/清汇通用)";
        case "1505":
            return "被保险人清单(团单/清汇通用)";
        case "1506":
            return "被保险人清单(基金型健康险)";
        case "1148":
            return "健康险给付约定书";
        case "1150":
            return "汇交申请书(乙)(新)";
        case "1140":
            return "国寿境外紧急救援意外伤害及境外紧急救援医疗保险投保单";
        case "1154":
            return "贷款借款人专用投保单";
        case "1153":
            return "国寿小额贷款保险专用投保单";
        case "1187":
            return "家庭短期保险组合专用投保单";
        case "1195":
        	return "汇交申请书（银行转账专用）";
        default :
            break;
        }
    }
    
    //查询显示销售渠道
    com.orbps.publicSearch.salesChannelQuery = function(salesChannelName){
        switch (salesChannelName) {
        case "BS":
            return "业务员";
        case "EB":
            return "网上直销";
        case "OA":
            return "机构代理";
        case "PA":
            return "个人代理";
        case "PH":
            return "电话销售";
        case "RD":
            return "农村网点";
        case "SD":
            return "营业网点";
        case "SP":
            return "（银保通）代理点";
        default:
            break;
        }
    }
    
    //查询显示交费形式
    com.orbps.publicSearch.moneyinTypeQuery = function(moneyinType){
        switch (moneyinType) {
        case "C":
            return "现金";
        case "T":
            return "银行转账";
        case "R":
            return "银行交款单";
        case "W":
            return "贷款凭证";
        case "Q":
            return "支票";
        case "P":
            return "POS机";
        case "D":
            return "社保结算";
        case "M":
            return "事后收费";
        default:
            break;
        }
    }
    //查询显示行业类别
    com.orbps.publicSearch.occClassCodeQuery = function(occClassCode){
        switch (occClassCode) {
        case "00":
            return "一般职业";
        case "01":
            return "农牧业";
        case "02":
            return "渔业";
        case "03":
            return "木材森林业";
        case "04":
            return "矿业采石业";
        case "05":
            return "交通运输业";
        case "06":
            return "餐旅业";
        case "07":
            return "建筑工程业";
        case "08":
            return "制造业";
        case "09":
            return "新闻出版广告业";
        case "10":
            return "卫生";
        case "11":
            return "娱乐业";
        case "12":
            return "文教";
        case "13":
            return "宗教";
        case "14":
            return "公共事业";
        case "15":
            return "商业";
        case "16":
            return "金融保险业";
        case "17":
            return "服务业";
        case "18":
            return "家庭管理";
        case "19":
            return "治安人员";
        case "20":
            return "教育";
        case "21":
            return "其他";
        default:
            break;
        }
    }
    
    //查询显示职业代码
    com.orbps.publicSearch.ipsnOccSubclsCodeQuery = function(ipsnOccSubclsCode){
    	var arrList = [{"value":"","text":""},{"value":"000000","text":"000000-其它：无职业"},
    	                               {"value":"000001","text":"000001-其它：离退休"},{"value":"000002","text":"000002-其它：婴幼儿"},
    	                               {"value":"000003","text":"000003-其它：军人"},{"value":"000101","text":"000101-机关、团体、公司：公务员、职员（内勤）"},{"value":"000102","text":"000102-机关、团体、公司：维修工、司机（外勤）"},{"value":"000103","text":"000103-机关、团体、公司：其他工作人员"},{"value":"010101","text":"010101-农业：种植业者"},{"value":"010102","text":"010102-农业：养殖业者"},{"value":"010103","text":"010103-农业：果农"},{"value":"010104","text":"010104-农业：苗圃工"},{"value":"010105","text":"010105-农业：农业管理人员(不亲自作业)"},
    	                               {"value":"010106","text":"010106-农业：农业技师"},{"value":"010107","text":"010107-农业：农业工人"},
    	                               {"value":"010108","text":"010108-农业：农业机械操作或维修人员"},{"value":"010109","text":"010109-农业：农业实验人员"},
    	                               {"value":"010110","text":"010110-农业：农副特产品加工人员"},{"value":"010111","text":"010111-农业：热带作物生产人员"},
    	                               {"value":"010112","text":"010112-农业：长短工"},{"value":"010113","text":"010113-农业：农具商"},
    	                               {"value":"010201","text":"010201-蓄牧业：畜牧管理人员(不亲自作业)"},{"value":"010202","text":"010202-蓄牧业：圈牧人员"},
    	                               {"value":"010203","text":"010203-蓄牧业：放牧人员"},{"value":"010204","text":"010204-蓄牧业：兽医"},
    	                               {"value":"010205","text":"010205-蓄牧业：动物疫病防治人员"},{"value":"010206","text":"010206-蓄牧业：实验动物饲养人员"},
    	                               {"value":"010207","text":"010207-蓄牧业：草业生产人员"},{"value":"010208","text":"010208-蓄牧业：家禽、家畜等饲养人员"},
    	                               {"value":"010209","text":"010209-蓄牧业：其他畜牧业生产人员"},{"value":"010210","text":"010210-蓄牧业：畜牧管理人员（亲自作业）"},{"value":"010211","text":"010211-蓄牧业：昆虫（蜜蜂）饲养人员"},
    	                               {"value":"010212","text":"010212-蓄牧业：宠物健康护理员"},{"value":"020101","text":"020101-内陆渔业：渔场管理人员(不亲自作业)"},
    	                               {"value":"020102","text":"020102-内陆渔业：渔场管理人员(亲自作业)"},{"value":"020103","text":"020103-内陆渔业：养殖工人(内陆)"},{"value":"020104","text":"020104-内陆渔业：养殖工人(沿海)"},{"value":"020105","text":"020105-内陆渔业：捕鱼人(内陆)"},
    	                               {"value":"020107","text":"020107-内陆渔业：水产实验人员(室内)"},{"value":"020108","text":"020108-内陆渔业：捕鱼人(沿海)"},{"value":"020109","text":"020109-内陆渔业：水产品加工人员"},{"value":"020110","text":"020110-内陆渔业：水族馆经营者"},{"value":"020111","text":"020111-内陆渔业：鱼类加工工人(渔船)"},{"value":"020201","text":"020201-海上渔业：海洋渔船船员"},
    	                               {"value":"020202","text":"020202-海上渔业：近海渔业"},{"value":"020203","text":"020203-海上渔业：远洋渔业"},{"value":"020204","text":"020204-海上渔业：海上救援人员"},{"value":"030101","text":"030101-造林业：山林管理员"},{"value":"030102","text":"030102-造林业：山地造林工人"},{"value":"030103","text":"030103-造林业：森林防火员"},{"value":"030104","text":"030104-造林业：平地育苗人员"},{"value":"030105","text":"030105-造林业：实验室育苗栽培人员"},{"value":"030201","text":"030201-砍伐业：生产行政管理员"},{"value":"030202","text":"030202-砍伐业：伐木工人"},
    	                               {"value":"030203","text":"030203-砍伐业：运材车辆司机及押运人员"},{"value":"030204","text":"030204-砍伐业：起重机操作工人"},{"value":"030205","text":"030205-砍伐业：装运工人"},{"value":"030206","text":"030206-砍伐业：领班"},{"value":"030207","text":"030207-砍伐业：木材工厂现场工作人员"},{"value":"030301","text":"030301-木材加工业：一般工作人员"},{"value":"030302","text":"030302-木材加工业：技术人员"},{"value":"030303","text":"030303-木材加工业：锯木工人"},{"value":"030304","text":"030304-木材加工业：防腐剂工人"},{"value":"030305","text":"030305-木材加工业：木材储藏槽工人"},{"value":"030306","text":"030306-木材加工业：木材搬运工人"},{"value":"030307","text":"030307-木材加工业：吊车操作人员"},{"value":"030308","text":"030308-木材加工业：领班"},
    	                               {"value":"030309","text":"030309-木材加工业：合板制造工人"},{"value":"030310","text":"030310-木材加工业：分级员"},{"value":"030311","text":"030311-木材加工业：检查员"},{"value":"030312","text":"030312-木材加工业：标记员"},{"value":"030313","text":"030313-木材加工业：磅秤员"},{"value":"030401","text":"030401-森林资源管护人员：护林员"},{"value":"030402","text":"030402-森林资源管护人员：森林病虫害防治员"},{"value":"030403","text":"030403-森林资源管护人员：其他森林资源管护人员"},{"value":"030501","text":"030501-野生动植物保护及自然保护区人员：野生动物保护人员"},{"value":"030502","text":"030502-野生动植物保护及自然保护区人员：野生植物保护人员"},{"value":"030503","text":"030503-野生动植物保护及自然保护区人员：自然保护区巡护监测员"},{"value":"030504","text":"030504-野生动植物保护及自然保护区人员：标本员"},
    	                               {"value":"040101","text":"040101-坑外作业：生产管理人员(不到现场)"},{"value":"040102","text":"040102-坑外作业：矿业工程师、技师、领班"},{"value":"040103","text":"040103-坑外作业：采石、采矿作业人员"},{"value":"040104","text":"040104-坑外作业：油矿、钻勘作业人员"},{"value":"040105","text":"040105-坑外作业：其他作业人员"},{"value":"040106","text":"040106-坑外作业：其他工作人员"},{"value":"040107","text":"040107-坑外作业：工矿安全人员"},{"value":"040108","text":"040108-坑外作业：其他矿物处理人员"},{"value":"040109","text":"040109-坑外作业：生产管理人员(现场监督)"},{"value":"040201","text":"040201-坑道内作业：国有统配煤矿：生产技术管理人员"},{"value":"040202","text":"040202-坑道内作业：国有统配煤矿：采掘工"},{"value":"040203","text":"040203-坑道内作业：国有统配煤矿：其他作业人员"},{"value":"040204","text":"040204-坑道内作业：地方国有煤矿：生产技术管理人员"},{"value":"040205","text":"040205-坑道内作业：地方国有煤矿：采掘工"},{"value":"040206","text":"040206-坑道内作业：地方国有煤矿：其他作业人员"},{"value":"040207","text":"040207-坑道内作业：城镇集体企业煤矿：生产技术管理人员"},{"value":"040208","text":"040208-坑道内作业：城镇集体企业煤矿：采掘工"},{"value":"040209","text":"040209-坑道内作业：城镇集体企业煤矿：其他作业人员"},{"value":"040210","text":"040210-坑道内作业：个人私营煤矿、采石、采矿"},{"value":"040211","text":"040211-坑道内作业：个体私营煤矿"},{"value":"040301","text":"040301-海上作业：所有作业人员(潜水人员咨询总公司)"},{"value":"040401","text":"040401-陆上油矿开采业：行政人员"},{"value":"040402","text":"040402-陆上油矿开采业：工程师"},{"value":"040403","text":"040403-陆上油矿开采业：技术员"},{"value":"040404","text":"040404-陆上油矿开采业：油气井清洁保养修护工"},{"value":"040405","text":"040405-陆上油矿开采业：钻勘设备装修保养工"},{"value":"040406","text":"040406-陆上油矿开采业：钻油井工人"},{"value":"040407","text":"040407-陆上油矿开采业：石油、天然气开采人员"},{"value":"040408","text":"040408-陆上油矿开采业：其他勘探及矿物开采人员"},{"value":"040501","text":"040501-海上油矿开采业：行政人员"},{"value":"040502","text":"040502-海上油矿开采业：工程师"},{"value":"040503","text":"040503-海上油矿开采业：技术员"},{"value":"040504","text":"040504-海上油矿开采业：油气井清洁保养修护工"},{"value":"040505","text":"040505-海上油矿开采业：钻勘设备装修保养工"},{"value":"040506","text":"040506-海上油矿开采业：钻油井工人"},{"value":"040507","text":"040507-海上油矿开采业：石油、天然气开采人员"},{"value":"040508","text":"040508-海上油矿开采业：其他勘探及矿物开采人员"},{"value":"050101","text":"050101-陆运：一般工作人员(不参与驾驶者)"},{"value":"050102","text":"050102-陆运：自用客货车司机"},{"value":"050103","text":"050103-陆运：出租车司机"},{"value":"050104","text":"050104-陆运：短途客货运输车司机及随车人员"},{"value":"050105","text":"050105-陆运：人力三轮车驾驶员"},{"value":"050106","text":"050106-陆运：拖拉机、农用四轮车驾驶人员"},
    	                               {"value":"050107","text":"050107-陆运：机动三轮车驾驶员"},{"value":"050108","text":"050108-陆运：长途客货运输车司机及随车人员"},{"value":"050109","text":"050109-陆运：装卸工人"},{"value":"050110","text":"050110-陆运：砂石车司机及随车人员"},{"value":"050111","text":"050111-陆运：工程卡车人员"},{"value":"050112","text":"050112-陆运：液化、汽化油罐车人员"},{"value":"050113","text":"050113-陆运：缆车操作员"},{"value":"050114","text":"050114-陆运：拖吊车驾驶及工作人员"},{"value":"050115","text":"050115-陆运：救护车驾驶员"},{"value":"050116","text":"050116-陆运：营运摩托车驾驶人员"},{"value":"050117","text":"050117-陆运：垃圾车驾驶员"},{"value":"050118","text":"050118-陆运：故障处理巡逻员"},{"value":"050119","text":"050119-陆运：试车员"},{"value":"050120","text":"050120-陆运：驾驶教练"},{"value":"050121","text":"050121-陆运：小型货车驾驶员"},{"value":"050201","text":"050201-铁路：一般工作人员"},{"value":"050202","text":"050202-铁路：车站清洁工人"},{"value":"050203","text":"050203-铁路：随车人员(技术人员除外)"},{"value":"050204","text":"050204-铁路：驾驶员"},{"value":"050205","text":"050205-铁路：燃料填充员"},{"value":"050206","text":"050206-铁路：机、电工"},{"value":"050207","text":"050207-铁路：修理厂一般工作人员"},{"value":"050208","text":"050208-铁路：修理厂技工"},{"value":"050209","text":"050209-铁路：修理工"},{"value":"050210","text":"050210-铁路：铁路维修工"},{"value":"050211","text":"050211-铁路：道口看守人员"},{"value":"050212","text":"050212-铁路：装卸搬运工人"},{"value":"050213","text":"050213-铁路：月台工作人员"},
    	                               {"value":"050214","text":"050214-铁路：修理厂工程师"},{"value":"050215","text":"050215-铁路：货运领班"},{"value":"050216","text":"050216-铁路：列车长"},{"value":"050217","text":"050217-铁路：列车员"},{"value":"050218","text":"050218-铁路：巡视员（铁路/桥梁工程/区域）"},{"value":"050301","text":"050301-航运：船长"},{"value":"050302","text":"050302-航运：轮机长"},{"value":"050303","text":"050303-航运：大副"},{"value":"050304","text":"050304-航运：二副"},{"value":"050305","text":"050305-航运：三副"},{"value":"050306","text":"050306-航运：大管轮"},{"value":"050307","text":"050307-航运：二管轮"},{"value":"050308","text":"050308-航运：三管轮"},{"value":"050309","text":"050309-航运：报务员"},{"value":"050310","text":"050310-航运：事务长"},{"value":"050311","text":"050311-航运：医务人员"},{"value":"050312","text":"050312-航运：水手长"},{"value":"050313","text":"050313-航运：水手"},{"value":"050314","text":"050314-航运：铁匠、木匠、泵匠"},{"value":"050315","text":"050315-航运：电机师"},{"value":"050316","text":"050316-航运：厨师"},{"value":"050317","text":"050317-航运：服务员"},{"value":"050318","text":"050318-航运：实习生"},{"value":"050319","text":"050319-航运：游览船驾驶及工作人员"},{"value":"050320","text":"050320-航运：小汽艇驾驶及工作人员"},{"value":"050321","text":"050321-航运：码头工人及领班"},{"value":"050322","text":"050322-航运：起重机械操作员"},{"value":"050323","text":"050323-航运：仓库管理人"},{"value":"050324","text":"050324-航运：领航员"},{"value":"050325","text":"050325-航运：引水人"},{"value":"050326","text":"050326-航运：关务人员"},{"value":"050327","text":"050327-航运：稽查人员"},{"value":"050328","text":"050328-航运：缉私人员"},{"value":"050329","text":"050329-航运：拖船驾驶员及工作人员"},{"value":"050330","text":"050330-航运：渡船驾驶员及工作人员"},
    	                               {"value":"050331","text":"050331-航运：救难船员"},{"value":"050332","text":"050332-航运：港口装卸指挥人员"},{"value":"050401","text":"050401-空运：飞机场：一般工作人员"},{"value":"050402","text":"050402-空运：飞机场：缉私人员"},{"value":"050403","text":"050403-空运：飞机场：清洁工人"},{"value":"050404","text":"050404-空运：飞机场：机场内交通司机"},{"value":"050405","text":"050405-空运：飞机场：行李货物搬运工"},{"value":"050406","text":"050406-空运：飞机场：加添燃料员"},{"value":"050407","text":"050407-空运：飞机场：航空清洁工(内)、飞机洗刷人员(外)"},{"value":"050408","text":"050408-空运：飞机场：跑道维护工"},{"value":"050409","text":"050409-空运：飞机场：机械员"},{"value":"050410","text":"050410-空运：飞机场：飞机修护人员"},{"value":"050411","text":"050411-空运：航空货运：一般工作人员"},{"value":"050412","text":"050412-空运：航空货运：理货员"},{"value":"050413","text":"050413-空运：空勤人员：民航机飞行人员及服务人员"},{"value":"050414","text":"050414-空运：空勤人员：机上服务员"},{"value":"050415","text":"050415-空运：航空公司：直升机飞行员"},{"value":"050416","text":"050416-空运：航空公司：一般工作人员"},{"value":"050417","text":"050417-空运：航空公司：票务人员"},{"value":"050418","text":"050418-空运：航空公司：机场柜台人员"},{"value":"050419","text":"050419-空运：航空公司：清仓员"},{"value":"050420","text":"050420-空运：航空公司：外务人员"},{"value":"050421","text":"050421-空运：航空公司：报关人员"},{"value":"050422","text":"050422-空运：航空公司：国际航线飞行人员及服务人员"},{"value":"050423","text":"050423-空运：航空公司：国内航线飞行人员及服务人员"},{"value":"050424","text":"050424-空运：航空公司：飞行训练学员"},{"value":"050425","text":"050425-空运：机场保安员"},{"value":"050426","text":"050426-空运：飞行教员（航空公司）"},{"value":"050427","text":"050427-空运：试飞员"},{"value":"050428","text":"050428-空运：空中摄影师/测量师"},{"value":"050429","text":"050429-空运：飞行俱乐部教员"},{"value":"050430","text":"050430-空运：表演飞行员（不含特技表演）"},{"value":"050431","text":"050431-空运：作物喷雾机驾驶员"},{"value":"050432","text":"050432-空运：热气球飞行员"},{"value":"060101","text":"060101-旅游业：一般内勤人员"},{"value":"060102","text":"060102-旅游业：外务员"},{"value":"060103","text":"060103-旅游业：导游"},{"value":"060104","text":"060104-旅游业：司机"},{"value":"060201","text":"060201-旅馆业：一般工作人员"},{"value":"060202","text":"060202-旅馆业：服务人员"},{"value":"060203","text":"060203-旅馆业：外务员"},{"value":"060204","text":"060204-旅馆业：技工"},{"value":"060301","text":"060301-餐饮业：一般工作人员"},{"value":"060302","text":"060302-餐饮业：采买"},{"value":"060303","text":"060303-餐饮业：厨师"},{"value":"060304","text":"060304-餐饮业：服务员"},{"value":"060305","text":"060305-餐饮业：收帐员"},{"value":"060306","text":"060306-餐饮业：屠宰工人"},{"value":"060307","text":"060307-餐饮业：快餐店员工—送餐"},
    	                               {"value":"070101","text":"070101-建筑公司（土木工程）：一般工作人员"},{"value":"070102","text":"070102-建筑公司（土木工程）：建筑设计人员"},{"value":"070103","text":"070103-建筑公司（土木工程）：现场技术检查员"},{"value":"070104","text":"070104-建筑公司（土木工程）：领班"},{"value":"070105","text":"070105-建筑公司（土木工程）：模板工"},{"value":"070106","text":"070106-建筑公司（土木工程）：木匠（室内）、泥水匠（室内）"},{"value":"070107","text":"070107-建筑公司（土木工程）：泥水匠（室外及高处）"},{"value":"070108","text":"070108-建筑公司（土木工程）：建筑工程车辆机械操作员"},{"value":"070109","text":"070109-建筑公司（土木工程）：建筑工程车辆驾驶员"},{"value":"070110","text":"070110-建筑公司（土木工程）：油漆工（室内）"},{"value":"070111","text":"070111-建筑公司（土木工程）：水电工（室内）"},{"value":"070112","text":"070112-建筑公司（土木工程）：钢骨结构工人"},{"value":"070113","text":"070113-建筑公司（土木工程）：钢架架设工人"},{"value":"070114","text":"070114-建筑公司（土木工程）：焊工（室内）"},{"value":"070115","text":"070115-建筑公司（土木工程）：焊工（室外及高处）"},{"value":"070116","text":"070116-建筑公司（土木工程）：楼宇拆除工人（无需用炸药）"},{"value":"070117","text":"070117-建筑公司（土木工程）：楼宇拆除工人（需用炸药）"},{"value":"070118","text":"070118-建筑公司（土木工程）：安装玻璃幕墙工人、扎铁工人"},{"value":"070119","text":"070119-建筑公司（土木工程）：散工"},{"value":"070120","text":"070120-建筑公司（土木工程）：推土机操作员"},{"value":"070121","text":"070121-建筑公司（土木工程）：负责人（不亲自作业不在现场）"},{"value":"070122","text":"070122-建筑公司（土木工程）：负责人（不亲自作业偶到现场）"},{"value":"070123","text":"070123-建筑公司（土木工程）：负责人（亲自作业视具体性质）"},{"value":"070124","text":"070124-建筑公司（土木工程）：外勤人员"},{"value":"070125","text":"070125-建筑公司（土木工程）：测量人员"},{"value":"070126","text":"070126-建筑公司（土木工程）：工程人员"},{"value":"070127","text":"070127-建筑公司（土木工程）：工地服务人员"},{"value":"070128","text":"070128-建筑公司（土木工程）：木匠（室外及高处）"},{"value":"070129","text":"070129-建筑公司（土木工程）：混凝土混合机操作员"},{"value":"070130","text":"070130-建筑公司（土木工程）：磨石工人"},{"value":"070131","text":"070131-建筑公司（土木工程）：洗石工人"},{"value":"070132","text":"070132-建筑公司（土木工程）：安装工人（室外及高处）"},{"value":"070133","text":"070133-建筑公司（土木工程）：装修人员"},{"value":"070134","text":"070134-建筑公司（土木工程）：排水、防水工程人员"},{"value":"070135","text":"070135-建筑公司（土木工程）：油漆工（室外及高处）"},{"value":"070136","text":"070136-建筑公司（土木工程）：水电工（地下）"},{"value":"070137","text":"070137-建筑公司（土木工程）：清洁工人"},{"value":"070138","text":"070138-建筑公司（土木工程）：建筑物外墙、玻璃幕墙维护人员"},{"value":"070139","text":"070139-建筑公司（土木工程）：电工、管道工人、防火系统安装人员"},{"value":"070140","text":"070140-建筑公司（土木工程）：警报器安装人员"},{"value":"070141","text":"070141-建筑公司（土木工程）：电梯安装及修理人员"},{"value":"070142","text":"070142-建筑公司（土木工程）：物业管理行政、办公室工作人员"},{"value":"070143","text":"070143-建筑公司（土木工程）：保安"},{"value":"070144","text":"070144-建筑公司（土木工程）：工程师"},{"value":"070145","text":"070145-建筑公司（土木工程）：竹脚手架搭建工"},{"value":"070201","text":"070201-铁路道路铺设：现场技术检查员"},{"value":"070202","text":"070202-铁路道路铺设：工程机械操作员"},{"value":"070203","text":"070203-铁路道路铺设：工程车辆驾驶员"},{"value":"070204","text":"070204-铁路道路铺设：铺设工人（平地）"},{"value":"070205","text":"070205-铁路道路铺设：维护工人"},{"value":"070206","text":"070206-铁路道路铺设：电线架设及维护工人"},{"value":"070207","text":"070207-铁路道路铺设：管道铺设及维护工人"},{"value":"070208","text":"070208-铁路道路铺设：铺设工人（山地）"},
    	                               {"value":"070209","text":"070209-铁路道路铺设：工程师"},{"value":"070301","text":"070301-电梯升降梯：安装工人"},{"value":"070302","text":"070302-电梯升降梯：修理及维护工人"},{"value":"070303","text":"070303-电梯升降梯：操作员（不包括矿场使用者）"},{"value":"070401","text":"070401-装璜业：装璜业：设计人员"},{"value":"070402","text":"070402-装璜业：装璜业：室内装璜人员"},{"value":"070403","text":"070403-装璜业：装璜业：室外装璜人员(高处作业)"},{"value":"070404","text":"070404-装璜业：装璜业：地毯装设人员"},{"value":"070405","text":"070405-装璜业：装璜业：监工"},{"value":"070406","text":"070406-装璜业：造修船业：工程师"},{"value":"070407","text":"070407-装璜业：造修船业：领班、监工"},{"value":"070408","text":"070408-装璜业：造修船业：工人"},{"value":"070409","text":"070409-装璜业：造修船业：室外装潢人员（非高处作业）"},{"value":"070410","text":"070410-装璜业：造修船业：承包商"},{"value":"070411","text":"070411-装璜业：造修船业：金属门窗制作、安装工人"},{"value":"070501","text":"070501-其他：地质探测员(山区、海上)"},{"value":"070502","text":"070502-其他：工地看守员"},{"value":"070503","text":"070503-其他：海湾港口工程人员"},{"value":"070504","text":"070504-其他：水坝工程人员"},{"value":"070505","text":"070505-其他：桥梁工程人员"},{"value":"070506","text":"070506-其他：隧道工作人员"},{"value":"070507","text":"070507-其他：潜水工作人员"},{"value":"070508","text":"070508-其他：爆破工作人员"},{"value":"070509","text":"070509-其他：地质探测员(平地)"},{"value":"070510","text":"070510-其他：挖泥船工人、挖沙工人"},{"value":"070511","text":"070511-其他：寺庙彩绘人员"},{"value":"070512","text":"070512-其他：挖井工程人员"},{"value":"080101","text":"080101-钢铁厂：生产行政管理人员"},{"value":"080102","text":"080102-钢铁厂：技术人员"},{"value":"080103","text":"080103-钢铁厂：炼钢工人"},{"value":"080104","text":"080104-钢铁厂：其他工人"},{"value":"080201","text":"080201-铁工厂 机械厂：生产行政管理人员"},{"value":"080202","text":"080202-铁工厂 机械厂：技术人员"},{"value":"080203","text":"080203-铁工厂 机械厂：扳金工"},{"value":"080204","text":"080204-铁工厂 机械厂：装配工"},{"value":"080205","text":"080205-铁工厂 机械厂：焊接工(室内)"},{"value":"080206","text":"080206-铁工厂 机械厂：车床工"},{"value":"080207","text":"080207-铁工厂 机械厂：铸造工"},{"value":"080208","text":"080208-铁工厂 机械厂：水电工"},{"value":"080209","text":"080209-铁工厂 机械厂：锅炉工"},{"value":"080210","text":"080210-铁工厂 机械厂：电镀工"},{"value":"080211","text":"080211-铁工厂 机械厂：铣、剪、冲床工"},{"value":"080212","text":"080212-铁工厂 机械厂：化工产品生产通用工艺工人"},{"value":"080213","text":"080213-铁工厂 机械厂：石油炼制生产人员"},{"value":"080214","text":"080214-铁工厂 机械厂：煤化工生产人员"},{"value":"080215","text":"080215-铁工厂 机械厂：化学肥料生产人员"},{"value":"080216","text":"080216-铁工厂 机械厂：火药、炸药制造人员"},{"value":"080217","text":"080217-铁工厂 机械厂：日用化学品生产人员"},{"value":"080218","text":"080218-铁工厂 机械厂：其他化工产品生产人员"},{"value":"080219","text":"080219-铁工厂 机械厂：焊接工(室外及高处)"},{"value":"080220","text":"080220-铁工厂 机械厂：抛光工"},{"value":"080221","text":"080221-铁工厂 机械厂：切板工"},{"value":"080222","text":"080222-铁工厂 机械厂：回火工"},{"value":"080223","text":"080223-铁工厂 机械厂：磨工"},{"value":"080224","text":"080224-铁工厂 机械厂：铆工"},{"value":"080301","text":"080301-电子业：生产行政管理人员"},{"value":"080302","text":"080302-电子业：技术人员、工程师"},{"value":"080303","text":"080303-电子业：装配修理工"},{"value":"080304","text":"080304-电子业：制造工"},{"value":"080305","text":"080305-电子业：包装工"},{"value":"080401","text":"080401-电机业：生产行政管理人员"},{"value":"080402","text":"080402-电机业：技术人员"},{"value":"080403","text":"080403-电机业：空气调节器装修人员(高处)"},{"value":"080404","text":"080404-电机业：有关高压电工作人员"},{"value":"080405","text":"080405-电机业： 冷冻修理工、室内空调装修员"},{"value":"080501","text":"080501-塑胶业橡胶业：生产行政管理人员"},{"value":"080502","text":"080502-塑胶业橡胶业：技术人员"},
    	                               {"value":"080503","text":"080503-塑胶业橡胶业：工人"},{"value":"080504","text":"080504-塑胶业橡胶业：塑胶射出成型工人(自动)"},{"value":"080505","text":"080505-塑胶业橡胶业：塑胶射出成型个人(其他)"},{"value":"080506","text":"080506-塑胶业橡胶业：工程师"},{"value":"080601","text":"080601-水泥业（包括水泥、石膏石灰）：生产行政管理人员"},{"value":"080602","text":"080602-水泥业（包括水泥、石膏石灰）：技术人员"},{"value":"080603","text":"080603-水泥业（包括水泥、石膏石灰）：熟练工人"},{"value":"080604","text":"080604-水泥业（包括水泥、石膏石灰）：采掘工"},{"value":"080605","text":"080605-水泥业（包括水泥、石膏石灰）：爆破工"},{"value":"080606","text":"080606-水泥业（包括水泥、石膏石灰）：非熟练工人"},{"value":"080607","text":"080607-水泥业（包括水泥、石膏石灰）：石棉瓦工人、作业者"},{"value":"080608","text":"080608-水泥业（包括水泥、石膏石灰）：陶瓷、木炭、砖块制作工"},{"value":"080701","text":"080701-化学原料业：生产行政管理人员"},{"value":"080702","text":"080702-化学原料业：技术人员"},{"value":"080703","text":"080703-化学原料业：一般工人"},{"value":"080704","text":"080704-化学原料业：硫酸、盐酸、硝酸制造工"},{"value":"080705","text":"080705-化学原料业：电池制造工人"},{"value":"080706","text":"080706-化学原料业：液化气体制造工人"},{"value":"080801","text":"080801-炸药业：火药爆竹制造及处理人员(包括爆竹、烟火制造工)"},{"value":"080802","text":"080802-炸药业：火工品制造人员"},{"value":"080803","text":"080803-炸药业：雷管制造工"},{"value":"080804","text":"080804-炸药业：爆破器材制造、实验工"},{"value":"080901","text":"080901-汽车机车自行车制造业：生产行政管理人员"},
    	                               {"value":"080902","text":"080902-汽车机车自行车制造业：技术人员"},{"value":"080903","text":"080903-汽车机车自行车制造业：装造工人"},{"value":"080904","text":"080904-汽车机车自行车制造业：修理保养工人"},{"value":"080905","text":"080905-汽车机车自行车制造业：喷漆工人"},{"value":"080906","text":"080906-汽车机车自行车制造业：试车人员"},{"value":"081001","text":"081001-纺织及成衣业：生产行政管理人员"},
    	                               {"value":"081002","text":"081002-纺织及成衣业：技术人员"},{"value":"081003","text":"081003-纺织及成衣业：织造工人"},{"value":"081004","text":"081004-纺织及成衣业：染整工人"},{"value":"081005","text":"081005-纺织及成衣业：切棉、压边、锯工、椅垫工人"},{"value":"081006","text":"081006-纺织及成衣业：吹气、毛占、填料、机械操作"},{"value":"081007","text":"081007-纺织及成衣业：暴身于尘埃和有毒化合物工人"},{"value":"081101","text":"081101-造纸工业：生产行政管理人员"},{"value":"081102","text":"081102-造纸工业：技术人员"},{"value":"081103","text":"081103-造纸工业：造纸厂工人"},{"value":"081104","text":"081104-造纸工业：纸浆厂工人"},{"value":"081105","text":"081105-造纸工业：纸箱制造工人"},{"value":"081201","text":"081201-家俱装造：生产行政管理人员"},{"value":"081202","text":"081202-家俱装造：技术人员"},{"value":"081203","text":"081203-家俱装造：木制家俱装造修理工人"},{"value":"081204","text":"081204-家俱装造：金属家俱装造修理工人"},{"value":"081301","text":"081301-手工艺品业：生产行政管理人员"},{"value":"081302","text":"081302-手工艺品业：竹木制手工艺品加工工人"},{"value":"081303","text":"081303-手工艺品业：金属手工艺品加工工人"},{"value":"081304","text":"081304-手工艺品业：布类纸品工艺品加工工人"},{"value":"081305","text":"081305-手工艺品业：矿石手工艺品加工人员"},{"value":"081306","text":"081306-手工艺品业：其他手工艺品加工人员"},{"value":"081307","text":"081307-手工艺品业：陶瓷制作加工人员"},{"value":"081308","text":"081308-手工艺品业：玻璃制作加工人员"},{"value":"081309","text":"081309-手工艺品业：地毯纺织工"},{"value":"081401","text":"081401-其他：生产行政管理人员"},{"value":"081402","text":"081402-其他：技术人员"},{"value":"081403","text":"081403-其他：工人"},{"value":"081404","text":"081404-其他：从事有毒有害的作业人员"},{"value":"081405","text":"081405-其他：肥皂、洗洁精制造人员"},{"value":"081406","text":"081406-其他：烟草业制作人员"},{"value":"081501","text":"081501-电线电缆业：技师"},{"value":"081502","text":"081502-电线电缆业：工人"},{"value":"081601","text":"081601-食品饮料业：冰块制造工"},{"value":"081602","text":"081602-食品饮料业：技师"},{"value":"081603","text":"081603-食品饮料业：碾米厂操作人员"},{"value":"081604","text":"081604-食品饮料业：其他制造工人"},{"value":"081605","text":"081605-食品饮料业：装罐工人"},{"value":"081606","text":"081606-食品饮料业：制造工人"},{"value":"081607","text":"081607-食品饮料业：屠宰工人"},{"value":"081608","text":"081608-食品饮料业：面包师"},{"value":"081609","text":"081609-食品饮料业：包装工（食品和饮料业）"},{"value":"081610","text":"081610-食品饮料业：家禽加工商"},{"value":"081701","text":"081701-航空制造业：飞机工程师"},{"value":"081702","text":"081702-航空制造业：飞机维修技师"},{"value":"090101","text":"090101-新 闻：一般工作人员"},{"value":"090102","text":"090102-新 闻：外勤记者"},{"value":"090103","text":"090103-新 闻：摄影记者"},{"value":"090104","text":"090104-新 闻：印刷厂工人"},{"value":"090105","text":"090105-新 闻：送报员"},{"value":"090106","text":"090106-新 闻：战地记者"},{"value":"090201","text":"090201-出版业：一般工作人员"},{"value":"090202","text":"090202-出版业：编辑人员"},{"value":"090203","text":"090203-出版业：摄影记者"},{"value":"090204","text":"090204-出版业：送货员"},{"value":"090301","text":"090301-广告业：一般工作人员"},{"value":"090302","text":"090302-广告业：外勤业务人员"},{"value":"090303","text":"090303-广告业：广告影片之拍摄录制人员"},{"value":"090304","text":"090304-广告业：广告招牌架设、安装人员（室外）"},{"value":"090305","text":"090305-广告业：广告招牌制作者（室内）"},{"value":"090306","text":"090306-广告业：玻璃匠及图样设计人员"},{"value":"090307","text":"090307-广告业：安装光管及外勤维修人员"},{"value":"100101","text":"100101-医院,诊所：一般医务行政人员"},{"value":"100102","text":"100102-医院,诊所：一般医师及护士"},{"value":"100103","text":"100103-医院,诊所：精神病科医师、看护及护士"},{"value":"100104","text":"100104-医院,诊所：病理检查员"},{"value":"100105","text":"100105-医院,诊所：放射线技术人员"},{"value":"100106","text":"100106-医院,诊所：放射线修护人员"},{"value":"100107","text":"100107-医院,诊所：医院炊事员"},{"value":"100108","text":"100108-医院,诊所：杂工"},{"value":"100109","text":"100109-医院,诊所：清洁工"},{"value":"100110","text":"100110-医院,诊所：监狱、看守所医生"},{"value":"100111","text":"100111-医院,诊所：助产士"},{"value":"100112","text":"100112-医院,诊所：跌打损伤治疗人员"},{"value":"100113","text":"100113-医院,诊所：护工（未经注册）"},{"value":"100114","text":"100114-医院,诊所：心理治疗师"},{"value":"100201","text":"100201-防疫,保健人员：一般医务行政人员"},
    	                               {"value":"100202","text":"100202-防疫,保健人员：一般医师及护士"},{"value":"100203","text":"100203-防疫,保健人员：分析员"},{"value":"100204","text":"100204-防疫,保健人员：消毒员"},{"value":"110101","text":"110101-影视及演艺业：行政人员"},{"value":"110102","text":"110102-影视及演艺业：制片人"},{"value":"110103","text":"110103-影视及演艺业：编剧"},{"value":"110104","text":"110104-影视及演艺业：一般演员（含导演）"},{"value":"110105","text":"110105-影视及演艺业：舞蹈演艺人员"},{"value":"110106","text":"110106-影视及演艺业：巡回演出文艺团体人员(杂技除外)"},{"value":"110107","text":"110107-影视及演艺业：一般杂技演员"},{"value":"110108","text":"110108-影视及演艺业：高难度动作杂技演员"},{"value":"110109","text":"110109-影视及演艺业：武打演员"},{"value":"110110","text":"110110-影视及演艺业：特技演员"},{"value":"110111","text":"110111-影视及演艺业：其他从业人员（绘画、演奏、作曲等"},{"value":"110112","text":"110112-影视及演艺业：驯兽师、空中飞人、走钢丝"},
    	                               {"value":"110113","text":"110113-影视及演艺业：饲养员"},{"value":"110114","text":"110114-影视及演艺业：化妆师"},{"value":"110115","text":"110115-影视及演艺业：场记"},{"value":"110116","text":"110116-影视及演艺业：摄影工作人员"},{"value":"110117","text":"110117-影视及演艺业：灯光及音响效果工作人员"},{"value":"110118","text":"110118-影视及演艺业：冲洗片工作人员"},{"value":"110119","text":"110119-影视及演艺业：电视记者"},{"value":"110120","text":"110120-影视及演艺业：机械工、电工"},{"value":"110121","text":"110121-影视及演艺业：布景搭设人员"},{"value":"110122","text":"110122-影视及演艺业：电影院售票员"},{"value":"110123","text":"110123-影视及演艺业：电影院放映人员"},{"value":"110124","text":"110124-影视及演艺业：电影院服务人员"},{"value":"110125","text":"110125-影视及演艺业：播音员"},{"value":"110126","text":"110126-影视及演艺业：主持人"},{"value":"110127","text":"110127-影视及演艺业：街头音乐家"},{"value":"110201","text":"110201-高尔夫球场：教练"},{"value":"110202","text":"110202-高尔夫球场：球场保养工人"},{"value":"110203","text":"110203-高尔夫球场：维护工人"},{"value":"110204","text":"110204-高尔夫球场：球场服务员"},{"value":"110301","text":"110301-保龄球馆：球馆服务"},{"value":"110302","text":"110302-保龄球馆：机械修护员"},{"value":"110303","text":"110303-保龄球馆：清洁工人"},{"value":"110304","text":"110304-保龄球馆：教练"},{"value":"110305","text":"110305-保龄球馆：球员"},{"value":"110401","text":"110401-撞球馆：负责人"},{"value":"110402","text":"110402-撞球馆：记分员"},{"value":"110501","text":"110501-游泳池及海水浴场：管理人员"},{"value":"110502","text":"110502-游泳池及海水浴场：服务员"},{"value":"110503","text":"110503-游泳池及海水浴场：游泳池救生员"},{"value":"110504","text":"110504-游泳池及海水浴场：海水浴场救生员"},{"value":"110601","text":"110601-其他游乐园(包括动物)：管理人员"},{"value":"110602","text":"110602-其他游乐园(包括动物)：售票员"},{"value":"110603","text":"110603-其他游乐园(包括动物)：电动玩具操作员"},{"value":"110604","text":"110604-其他游乐园(包括动物)：一般清洁工"},{"value":"110605","text":"110605-其他游乐园(包括动物)：兽栏清洁工"},{"value":"110606","text":"110606-其他游乐园(包括动物)：水电机械工"},{"value":"110607","text":"110607-其他游乐园(包括动物)：动物园驯兽师"},{"value":"110608","text":"110608-其他游乐园(包括动物)：饲养人员"},{"value":"110701","text":"110701-其他：咖啡厅工作人员"},{"value":"110702","text":"110702-其他：茶室工作人员"},{"value":"110703","text":"110703-其他：酒家工作人员"},{"value":"110704","text":"110704-其他：歌厅工作人员"},{"value":"110705","text":"110705-其他：舞厅工作人员"},{"value":"110706","text":"110706-其他：夜总会工作人员"},{"value":"110707","text":"110707-其他：酒店、网吧工作人员"},{"value":"120101","text":"120101-教育机构：教师"},{"value":"120102","text":"120102-教育机构：学生"},{"value":"120103","text":"120103-教育机构：校工"},{"value":"120104","text":"120104-教育机构：体育老师"},{"value":"120105","text":"120105-教育机构：军训教官"},{"value":"120106","text":"120106-教育机构：各项运动教练"},{"value":"120107","text":"120107-教育机构：汽车驾驶训练教练"},{"value":"120108","text":"120108-教育机构：健身教练"},{"value":"120201","text":"120201-书店,文具及其他：维修工"},{"value":"120202","text":"120202-书店,文具及其他：一般工作人员"},{"value":"120203","text":"120203-书店,文具及其他：售货员"},{"value":"120204","text":"120204-书店,文具及其他：外勤人员"},{"value":"120205","text":"120205-书店,文具及其他：博物馆工作人员"},{"value":"120206","text":"120206-书店,文具及其他：图书馆工作人员"},{"value":"130101","text":"130101-教堂寺庙：寺庙及教堂管理人员"},{"value":"130102","text":"130102-教堂寺庙：宗教团体工作人员"},{"value":"130103","text":"130103-教堂寺庙：僧尼、道士及传教人员"},{"value":"140101","text":"140101-邮政：内勤人员"},
    	                               {"value":"140102","text":"140102-邮政：骑摩托车邮递人员"},{"value":"140103","text":"140103-邮政：邮递人员"},{"value":"140104","text":"140104-邮政：包裹搬运工"},{"value":"140105","text":"140105-邮政：骑自行车邮递人员"},{"value":"140106","text":"140106-邮政：快递货车司机"},{"value":"140201","text":"140201-电信及电力：内勤人员"},{"value":"140202","text":"140202-电信及电力：抄表员、收费员"},{"value":"140203","text":"140203-电信及电力：电信电力装置维护修理工"},{"value":"140204","text":"140204-电信及电力：电信电力工程设施之架设人员"},{"value":"140205","text":"140205-电信及电力：电信高压电工程设施人员"},{"value":"140206","text":"140206-电信及电力：核能发电厂工作人员"},{"value":"140207","text":"140207-电信及电力：电台天线维护人员"},{"value":"140301","text":"140301-自来水(水利)：一般工作人员"},{"value":"140302","text":"140302-自来水(水利)：抄表员、收费员"},{"value":"140303","text":"140303-自来水(水利)：水坝、水库管理人员"},{"value":"140304","text":"140304-自来水(水利)：水利工程设施人员"},{"value":"140305","text":"140305-自来水(水利)：自来水管装修人员"},{"value":"140306","text":"140306-自来水(水利)：水土保持作业人员"},{"value":"140307","text":"140307-自来水(水利)：水文勘测作业人员"},{"value":"140308","text":"140308-自来水(水利)：水质分析员"},{"value":"140309","text":"140309-自来水(水利)：其他水利设施管护人员"},{"value":"140310","text":"140310-自来水(水利)：其他水利能源开发人员"},{"value":"140401","text":"140401-煤气热力：一般工作人员"},{"value":"140402","text":"140402-煤气热力：收费员、抄表员、检察员"},{"value":"140403","text":"140403-煤气热力：管线装修工"},{"value":"140404","text":"140404-煤气热力：煤气器具制造工"},{"value":"140405","text":"140405-煤气热力：操作工"},{"value":"140406","text":"140406-煤气热力：煤气分装工"},{"value":"140407","text":"140407-煤气热力：液化气罐随车司机及工人"},{"value":"150101","text":"150101-批发业：一般工作人员"},{"value":"150102","text":"150102-批发业：售货员"},{"value":"150103","text":"150103-批发业：仓库保管员"},{"value":"150104","text":"150104-批发业：燃料仓库保管员"},{"value":"150105","text":"150105-批发业：搬运工"},{"value":"150106","text":"150106-批发业：司机"},{"value":"150201","text":"150201-零售：一般工作人员"},{"value":"150202","text":"150202-零售：售货员"},{"value":"150203","text":"150203-零售：珠宝工艺品售货员"},{"value":"150204","text":"150204-零售：保管员"},{"value":"150205","text":"150205-零售：采购、推销员"},{"value":"150206","text":"150206-零售：搬运"},{"value":"150207","text":"150207-零售：司机"},{"value":"150208","text":"150208-零售：厨具、陶瓷、古董、花卉商"},{"value":"150209","text":"150209-零售：银楼、当铺、杂货、食品商"},{"value":"150210","text":"150210-零售：家具、机车、眼镜、文具商"},{"value":"150211","text":"150211-零售：布匹、服饰、药品、工艺商"},{"value":"150212","text":"150212-零售：玻璃、石材、建材、钢材商"},{"value":"150213","text":"150213-零售：木材、五金、电器、器材商"},{"value":"150214","text":"150214-零售：肉鱼、医疗仪器、珠宝商"},{"value":"150215","text":"150215-零售：化学原料商"},{"value":"150216","text":"150216-零售：液化瓦斯零售商"},{"value":"150217","text":"150217-零售：瓦斯分装工"},{"value":"150218","text":"150218-零售：旧货收购人员"},{"value":"150219","text":"150219-零售：零售摊位租用人"},{"value":"150220","text":"150220-零售：上门销售人员"},{"value":"150221","text":"150221-零售：理货员（超市）"},{"value":"160101","text":"160101-银行、保险、信托证券、典当：内勤人员"},{"value":"160102","text":"160102-银行、保险、信托证券、典当：外勤人员"},{"value":"160103","text":"160103-银行、保险、信托证券、典当：储蓄所工作人员"},{"value":"160104","text":"160104-银行、保险、信托证券、典当：营业点工作人员"},{"value":"160105","text":"160105-银行、保险、信托证券、典当：运钞押运人员（含司机）"},{"value":"160106","text":"160106-银行、保险、信托证券、典当：投资分析师"},{"value":"160107","text":"160107-银行、保险、信托证券、典当：保险理赔、调查人员"},{"value":"160108","text":"160108-银行、保险、信托证券、典当：证券经销经纪人"},
    	                               {"value":"160109","text":"160109-银行、保险、信托证券、典当：股票经纪人"},{"value":"170101","text":"170101-自由业：律师"},{"value":"170102","text":"170102-自由业：会计师"},{"value":"170103","text":"170103-自由业：文书"},{"value":"170104","text":"170104-自由业：经纪人"},{"value":"170201","text":"170201-普通服务业：理发师"},{"value":"170202","text":"170202-普通服务业：美容师、形象设计师"},{"value":"170203","text":"170203-普通服务业：浴室（领有牌照的）"},{"value":"170204","text":"170204-普通服务业：各业修理工"},{"value":"170205","text":"170205-普通服务业：刻字工"},{"value":"170206","text":"170206-普通服务业：洗衣店工人"},{"value":"170207","text":"170207-普通服务业：大楼管理员、市场管理员"},{"value":"170208","text":"170208-普通服务业：摄影师"},{"value":"170209","text":"170209-普通服务业：服装加工工人"},{"value":"170210","text":"170210-普通服务业：警卫人员（有巡逻押运任务者）"},{"value":"170211","text":"170211-普通服务业：警卫人员（内勤）"},{"value":"170212","text":"170212-普通服务业：保镖"},{"value":"170213","text":"170213-普通服务业：邮递人员"},{"value":"170214","text":"170214-普通服务业：公证行外务员"},{"value":"170215","text":"170215-普通服务业：报关行外务员"},{"value":"170216","text":"170216-普通服务业：冲印师"},{"value":"170217","text":"170217-普通服务业：裁缝"},{"value":"170218","text":"170218-普通服务业：浴室：一般管理及工作人员"},{"value":"170219","text":"170219-普通服务业：浴室：服务员、护卫员、接待员"},{"value":"170220","text":"170220-普通服务业：浴室：按摩人员"},{"value":"170221","text":"170221-普通服务业：洗碗工"},{"value":"170222","text":"170222-普通服务业：公路绿化维护员"},{"value":"170223","text":"170223-普通服务业：私家侦探"},{"value":"170224","text":"170224-普通服务业：保安人员—酒吧或夜总会"},{"value":"170225","text":"170225-普通服务业：动物美容师"},{"value":"170226","text":"170226-普通服务业：代客泊车服务员"},{"value":"170301","text":"170301-其他：道路清洁工"},{"value":"170302","text":"170302-其他：下水道清洁工"},{"value":"170303","text":"170303-其他：高楼外部清洁工"},{"value":"170304","text":"170304-其他：存车及洗车工"},{"value":"170305","text":"170305-其他：装修工"},{"value":"170306","text":"170306-其他：殡葬工"},{"value":"170307","text":"170307-其他：烟囱清洁工"},{"value":"170308","text":"170308-其他：加油站工作人员"},{"value":"170401","text":"170401-资讯业：维护工程师"},{"value":"170402","text":"170402-资讯业：系统工程师"},{"value":"170403","text":"170403-资讯业：销售工程师"},{"value":"170501","text":"170501-IT行业：网页设计师"},{"value":"170502","text":"170502-IT行业：计算机图形设计师"},{"value":"170503","text":"170503-IT行业：数据库管理员"},{"value":"170504","text":"170504-IT行业：互联网技术员"},{"value":"170505","text":"170505-IT行业：无线电工程师"},{"value":"170506","text":"170506-IT行业：软件开发员"},{"value":"180101","text":"180101-家庭管理：家庭主妇（无业）"},{"value":"180102","text":"180102-家庭管理：佣人"},{"value":"180103","text":"180103-家庭管理：家庭护理"},{"value":"190101","text":"190101-治安人员安全、保卫、消防人员：警务行政及内勤人员"},{"value":"190102","text":"190102-治安人员安全、保卫、消防人员：警察（有巡逻任务者）"},{"value":"190103","text":"190103-治安人员安全、保卫、消防人员：监狱看守所管理人员"},{"value":"190104","text":"190104-治安人员安全、保卫、消防人员：交通警察"},{"value":"190105","text":"190105-治安人员安全、保卫、消防人员：刑警"},{"value":"190106","text":"190106-治安人员安全、保卫、消防人员：消防队队员"},{"value":"190107","text":"190107-治安人员安全、保卫、消防人员：保安人员"},{"value":"190108","text":"190108-治安人员安全、保卫、消防人员：治安人员"},{"value":"190109","text":"190109-治安人员安全、保卫、消防人员：主管、高级管理人员"},{"value":"190110","text":"190110-治安人员安全、保卫、消防人员：办公室公务人员"},{"value":"190111","text":"190111-治安人员安全、保卫、消防人员：炸药处理警察"},{"value":"190112","text":"190112-治安人员安全、保卫、消防人员：治安警察"},{"value":"190113","text":"190113-治安人员安全、保卫、消防人员：防暴警察"},{"value":"190114","text":"190114-治安人员安全、保卫、消防人员：警校学生"},{"value":"190115","text":"190115-治安人员安全、保卫、消防人员：铁路警察"},{"value":"190116","text":"190116-治安人员安全、保卫、消防人员：武警警员"},{"value":"190117","text":"190117-治安人员安全、保卫、消防人员：驯犬员"},{"value":"190118","text":"190118-治安人员安全、保卫、消防人员：法警"},{"value":"200101","text":"200101-球类：教练人员、裁判人员"},{"value":"200102","text":"200102-球类：足球运动员"},{"value":"200103","text":"200103-球类：篮球运动员"},{"value":"200104","text":"200104-球类：曲棍球运动员"},
    	                               {"value":"200105","text":"200105-球类：冰上曲棍球运动员"},{"value":"200106","text":"200106-球类：其他球类运动员"},{"value":"200107","text":"200107-球类：桌球、台球运动员"},{"value":"200108","text":"200108-球类：羽毛球运动员"},{"value":"200109","text":"200109-球类：网球运动员"},{"value":"200110","text":"200110-球类：垒球运动员"},{"value":"200111","text":"200111-球类：排球运动员"},{"value":"200112","text":"200112-球类：棒球运动员"},{"value":"200113","text":"200113-球类：手球运动员"},{"value":"200114","text":"200114-球类：巧固球运动员"},{"value":"200115","text":"200115-球类：橄榄球运动员"},{"value":"200116","text":"200116-球类：高尔夫运动员"},{"value":"200117","text":"200117-球类：保龄球运动员"},{"value":"200118","text":"200118-球类：壁球运动员"},{"value":"200201","text":"200201-田径：教练员"},{"value":"200202","text":"200202-田径：运动员"},{"value":"200301","text":"200301-体操：教练员"},{"value":"200302","text":"200302-体操：运动员"},{"value":"200401","text":"200401-游泳：教练员"},{"value":"200402","text":"200402-游泳：游泳运动员"},{"value":"200403","text":"200403-游泳：跳水运动员"},{"value":"200501","text":"200501-射击,射箭：射击、射剑：教练员"},{"value":"200502","text":"200502-射击,射箭：射击、射剑：运动员"},{"value":"200503","text":"200503-射击,射箭：柔道、武术：教练员"},{"value":"200504","text":"200504-射击,射箭：柔道、武术：运动员"},{"value":"200505","text":"200505-射击,射箭：空手道：教练员"},{"value":"200506","text":"200506-射击,射箭：空手道：运动员"},{"value":"200507","text":"200507-射击,射箭：跆拳道：教练员"},{"value":"200508","text":"200508-射击,射箭：跆拳道：运动员"},{"value":"200601","text":"200601-举重：举重：教练员"},{"value":"200602","text":"200602-举重：举重：运动员"},{"value":"200701","text":"200701-拳击：教练员"},{"value":"200702","text":"200702-拳击：运动员"},{"value":"200801","text":"200801-赛车：教练员"},{"value":"200802","text":"200802-赛车：自行车运动员"},{"value":"200803","text":"200803-赛车：汽车赛车手"},{"value":"200804","text":"200804-赛车：摩托车赛车手"},{"value":"200901","text":"200901-水上运动：教练员"},{"value":"200902","text":"200902-水上运动：帆船、划船运动员"},{"value":"200903","text":"200903-水上运动：赛艇、风浪板运动员"},{"value":"200904","text":"200904-水上运动：水上摩托艇运动员"},{"value":"200905","text":"200905-水上运动：冲浪运动员"},{"value":"200906","text":"200906-水上运动：潜水运动员——0至50米"},{"value":"200907","text":"200907-水上运动：潜水运动员——50以上"},{"value":"200908","text":"200908-水上运动：潜水教练"},{"value":"201001","text":"201001-冰上运动：教练员"},{"value":"201002","text":"201002-冰上运动：滑冰运动员"},{"value":"201003","text":"201003-冰上运动：滑雪运动员"},{"value":"201004","text":"201004-冰上运动：冰壶运动员"},{"value":"201101","text":"201101-民俗体育活动：教练员"},{"value":"201102","text":"201102-民俗体育活动：运动员"},{"value":"201201","text":"201201-马术：教练"},{"value":"201202","text":"201202-马术：马房工人、马夫、练马师"},{"value":"201203","text":"201203-马术：骑师、见习骑师、参赛骑师"},{"value":"201301","text":"201301-特技表演：特技表演人员"},{"value":"201401","text":"201401-滑翔机具：教练"},{"value":"201402","text":"201402-滑翔机具：驾驶人员"},{"value":"201501","text":"201501-跳伞：教练"},{"value":"201502","text":"201502-跳伞：跳伞人员"},{"value":"201601","text":"201601-登山：教练"},{"value":"201602","text":"201602-登山：登山运动员"},{"value":"201701","text":"201701-汽车、机车赛车：教练"},
    	                               {"value":"201702","text":"201702-汽车、机车赛车：赛车人员"},{"value":"210101","text":"210101-执法监督：公、检、法、工商、税务、卫生、检验等执法监督人员"},{"value":"210201","text":"210201-企业：厂长"},{"value":"210202","text":"210202-企业：经理"},{"value":"210301","text":"210301-个体经营：商贩"},{"value":"210302","text":"210302-个体经营：无固定职业人员"},{"value":"210401","text":"210401-无业：学龄前儿童"},{"value":"210402","text":"210402-无业：离退休人员(无兼职)"},{"value":"210403","text":"210403-无业：其他人员（无兼职）"},{"value":"210501","text":"210501-现役军人：一般军人、军校学生（非军事专业）"},{"value":"210502","text":"210502-现役军人：行政及内勤人员"},{"value":"210503","text":"210503-现役军人：后勤补给及通讯、地勤人员"},{"value":"210504","text":"210504-现役军人：军医院官兵"},{"value":"210505","text":"210505-现役军人：军事研究单位设计人员"},{"value":"210506","text":"210506-现役军人：军事单位武器弹药研究、制作人员"},{"value":"210507","text":"210507-现役军人：伞兵部队"},{"value":"210508","text":"210508-现役军人：航空试飞人员"},{"value":"210509","text":"210509-现役军人：一般地面部队人员"},{"value":"210510","text":"210510-现役军人：特种兵"},{"value":"210511","text":"210511-现役军人：空军、海军、潜艇军人"},{"value":"210512","text":"210512-现役军人：军校学生（军事专业）及新兵"}]
    	
    	for (var i = 0; i < arrList.length; i++) {
    		if(ipsnOccSubclsCode === arrList[i].value){
    			var text =  arrList[i].text;
    			break;
    		}
    	}
    	return text;

    }
    
    //查询显示主附险性质
    com.orbps.publicSearch.mrCodeQuery = function(mrCode){
        switch (mrCode) {
        case "M":
            return "主险";
        case "R":
            return "附加险";
        default:
            break;
        }
    }
    //查询主副标记
      com.orbps.publicSearch.jointFieldWorkFlag = function(jointFieldWorkFlag){
          switch (jointFieldWorkFlag) {
          case "Y":
              return "是";
          case "N":
              return "否";
          default:
              break;
          }
      }
      
      //查询显示行业性质
      com.orbps.publicSearch.natureOfInstQuery = function(natureOfInstQuery){
          switch (occClassCode) {
          case "1":
              return "档次一";
          case "2":
              return "档次二";
          case "3":
              return "档次三";
          }
      }
      
    //查询性别
  	com.orbps.publicSearch.sex = function(sex) {
  		switch (sex) {
  		case "F":
  			return "女";
  		case "M":
  			return "男";
  		default:
  			break;
  		}
  	}
  	//查询保险期间类型
  	com.orbps.publicSearch.insurDurUnit = function(insurDurUnit) {
  		var arr=["年","约定","月","岁","天","终身","无关"];
  		if(arr.indexOf(insurDurUnit)>-1){
  			return insurDurUnit;
  		}else{
  			switch (insurDurUnit) {
  	  		case "Y":
  	  			return "年";
  	  		case "C":
  	  			return "约定";
  	  		case "M":
  	  			return "月";
  	  		case "A":
  	  			return "岁";
  	  		case "D":
  	  			return "天";
  	  		case "W":
  	  			return "终身";
  	  		case "#":
  	  			return "无关";
  	  		default:
  	  			break;
  	  		}
  		}
  	}
  	
  	
  	//健康险专项标识
  	com.orbps.publicSearch.speciBusinessLogo = function(speciBusinessLogo) {
  		switch (speciBusinessLogo) {
  		case "00":
  			return "非专项标识业务";
  		case "A1":
  			return "新农合";
  		case "A2":
  			return "新农合补充";
  		case "A3":
  			return "城镇职工基本医疗";
  		case "A4":
  			return "城镇职工补充医疗";
  		case "A5":
  			return "城镇居民基本医疗";
  		case "A6":
  			return "城镇居民补充医疗";
  		case "A7":
  			return "医疗救助";
  		case "A8":
  			return "企事业团体补充医疗";
  		case "A9":
  			return "其他委托管理业务";
  		default:
  			break;
  		}
  	}
  	/***
  	 * 根据select的id和select的value值查询相应的text值。
  	 * selectId :"#String #String"   注：精确到from下的哪个id
  	 * selectValue : "String"        注：select的value值。
  	 */
  	com.orbps.publicSearch.publicQuerySelectText = function(selectId ,selectValue){
  		if(selectId !== "" && selectValue !== "" && selectId !== undefined && selectValue !== undefined){
  			//获取所有的select的值 等同于原生的js document.getElementById(selectId); ，
  			//由于原生js中没法确认到那个from里的id，一个页面中如果有相同的id就容易出错
  			var oSelect = $(selectId)[0];
  			console.log(oSelect);
  			var index = 0;
  			//循环所有的select数组，对比对应的value值，如果一样，返回对应的下标
  			for (var i = 0; i < oSelect.length; i++) {
  				if(oSelect[i].value === selectValue){
  					 index = i;
  					 break;
  				}
  			}
  			//根据下标曲select数组中找到对应的text，返回
  			var tex = oSelect.options[index].text;
  	        return tex;
  		}
  		return "";
  	} 
//	var occClassCode = com.orbps.publicSearch.publicQuerySelectText("#proposalGroupInfoForm #occClassCode",com.orbps.common.proposalGroupList[i].occClassCode);
//	var ipsnOccSubclsCode = com.orbps.publicSearch.publicQuerySelectText("#proposalGroupInfoForm #ipsnOccSubclsCode",com.orbps.common.proposalGroupList[i].ipsnOccSubclsCode);
});
